### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [3]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [4]:
total_num_players = len(purchase_data["SN"].unique())
total_num_players

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
unique_items = len(purchase_data["Item ID"].unique())
unique_items
average_price = purchase_data["Price"].mean()
average_price
total_price = purchase_data["Price"].sum()
total_price
total_purchases = len(purchase_data["Purchase ID"].unique())
total_purchases
summarytable = pd.DataFrame({"Unique Items": [unique_items], "Average Price": [average_price], "Total Number of Purchases": [total_price], "Total Revenue": [total_purchases]})
summarytable.head()

   Unique Items  Average Price  Total Number of Purchases  Total Revenue
0           183       3.050987                    2379.77            780

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [6]:
total_count = purchase_data["SN"].count()
total_count

780

In [7]:
male_count = purchase_data[purchase_data["Gender"] == "Male"]["SN"].count()
male_count

652

In [8]:
male_percentage = male_count / total_count * 100
male_percentage

83.58974358974359

In [9]:
female_count = purchase_data[purchase_data["Gender"] == "Female"]["SN"].count()
female_count

113

In [10]:
female_percentage = female_count / total_count * 100
female_percentage

14.487179487179489

In [11]:
other_count = total_count - female_count - male_count
other_count

15

In [12]:
other_percentage = other_count / total_count * 100
other_percentage

1.9230769230769231

In [13]:
df = pd.DataFrame({"Gender": ["Male", "Female", "Other / Non-Disclosed"], "Percentage of Players": [male_percentage, female_percentage, other_percentage],"Total Count": [male_count, female_count, other_count]}, columns = ["Gender", "Percentage of Players", "Total Count"])
df.head()

                  Gender  Percentage of Players  Total Count
0                   Male              83.589744          652
1                 Female              14.487179          113
2  Other / Non-Disclosed               1.923077           15


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [14]:
gender_average = purchase_data.groupby(["Gender"]).mean()["Price"]
gender_average

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [15]:
gender_count = purchase_data.groupby(["Gender"]).count()["Price"]
gender_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [16]:
gender_purchase_total = purchase_data.groupby(["Gender"]).sum()["Price"]
gender_purchase_total

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [17]:
purchase_total_per_person = gender_purchase_total / gender_count
purchase_total_per_person

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [18]:
df2 = pd.DataFrame({"Purchase Count": gender_count, "Average Purchase Price": gender_average, "Total Purchase Value": gender_purchase_total,"Purchase Total Per Person, Average": purchase_total_per_person})
df2

,Purchase Count,Average Purchase Price,Total Purchase Value,"Purchase Total Per Person, Average"
Gender,,,,
Female,113,3.203009,361.94,3.203009
Male,652,3.017853,1967.64,3.017853
Other / Non-Disclosed,15,3.346000,50.19,3.346000

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [19]:
bins_for_ages = [0, 9.90, 14.90, 19.90, 24.9, 29.9, 34.90, 39.90, 9999999]
categorize_existing_players = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", ">40"]

In [20]:
demographic = pd.cut(purchase_data["Age"], bins_for_ages, labels=categorize_existing_players)
demographic

0      20-24
1        >40
2      20-24
3      20-24
4      20-24
       ...
775    20-24
776    20-24
777    20-24
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < >40]

In [21]:
#calculations
age_demographics_count = demographic.value_counts()
age_demographics_count

20-24    365
15-19    136
25-29    101
30-34     73
35-39     41
10-14     28
<10       23
>40       13
Name: Age, dtype: int64

In [22]:
age_percentage = age_demographics_count / total_num_players *100
age_percentage

20-24    63.368056
15-19    23.611111
25-29    17.534722
30-34    12.673611
35-39     7.118056
10-14     4.861111
<10       3.993056
>40       2.256944
Name: Age, dtype: float64

In [23]:
#create table
df3 = pd.DataFrame({"Total Count": age_demographics_count, "Percentage of Players": age_percentage})
df3

       Total Count  Percentage of Players
20-24          365              63.368056
15-19          136              23.611111
25-29          101              17.534722
30-34           73              12.673611
35-39           41               7.118056
10-14           28               4.861111
<10             23               3.993056
>40             13               2.256944

In [24]:
df3 = df3.sort_index()
df3

       Total Count  Percentage of Players
<10             23               3.993056
10-14           28               4.861111
15-19          136              23.611111
20-24          365              63.368056
25-29          101              17.534722
30-34           73              12.673611
35-39           41               7.118056
>40             13               2.256944

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [27]:
# Bin the Purchasing Data
purchase_data["Age Ranges"] = pd.cut(purchase_data["Age"], bins_for_ages, labels=categorize_existing_players)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,>40
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [28]:
total = purchase_data.groupby(["Age Ranges"]).sum()["Price"]
total

Age Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
>40        38.24
Name: Price, dtype: float64

In [29]:
average = purchase_data.groupby(["Age Ranges"]).mean()["Price"]
average

Age Ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
>40      2.941538
Name: Price, dtype: float64

In [30]:
total_count = purchase_data.groupby(["Age Ranges"]).count()["Price"]
total_count

Age Ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
>40       13
Name: Price, dtype: int64

In [31]:
per_person_data = total / total_count
per_person_data

Age Ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
>40      2.941538
Name: Price, dtype: float64

In [33]:
#create DataFrame table
df4 = pd.DataFrame({"Purchase Count": total_count, "Average Purchase Price": average, "Total Purchase Value": total, "Average Purchase Per Person": per_person_data})
df4

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Per Person
Age Ranges,,,,
<10,23,3.353478,77.13,3.353478
10-14,28,2.956429,82.78,2.956429
15-19,136,3.035956,412.89,3.035956
20-24,365,3.052219,1114.06,3.052219
25-29,101,2.900990,293.00,2.900990
30-34,73,2.931507,214.00,2.931507
35-39,41,3.601707,147.67,3.601707
>40,13,2.941538,38.24,2.941538

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [34]:
top_count = purchase_data.groupby(["SN"]).count()["Price"]
top_count.head()

SN
Adairialis76    1
Adastirin33     1
Aeda94          1
Aela59          1
Aelaria33       1
Name: Price, dtype: int64

In [36]:
top_mean_count = purchase_data.groupby(["SN"]).mean()["Price"]
top_mean_count.head()

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [37]:
top_total_value = purchase_data.groupby(["SN"]).sum()["Price"]
top_total_value.head()

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [38]:
df5 = pd.DataFrame({"Purchase Count": top_count, "Average Purchase Price": top_mean_count, "Total Purchase Value": top_total_value})
df5.head()

              Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48
Aeda94                     1                    4.91                  4.91
Aela59                     1                    4.32                  4.32
Aelaria33                  1                    1.79                  1.79

In [39]:
df5.sort_values("Total Purchase Value", ascending=False).head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [46]:
most_profitable_items = purchase_data.groupby(["Item ID", "Item Name"]).count()["Price"]
most_profitable_items

Item ID  Item Name
0        Splinter                           4
1        Crucifer                           3
2        Verdict                            6
3        Phantomlight                       6
4        Bloodlord's Fetish                 5
                                           ..
179      Wolf, Promise of the Moonwalker    6
180      Stormcaller                        1
181      Reaper's Toll                      5
182      Toothpick                          3
183      Dragon's Greatsword                3
Name: Price, Length: 183, dtype: int64

In [47]:
most_profit_price = purchase_data.groupby(["Item ID", "Item Name"]).mean()["Price"]
most_profit_price

Item ID  Item Name
0        Splinter                           1.28
1        Crucifer                           3.26
2        Verdict                            2.48
3        Phantomlight                       2.49
4        Bloodlord's Fetish                 1.70
                                            ...
179      Wolf, Promise of the Moonwalker    4.48
180      Stormcaller                        3.36
181      Reaper's Toll                      1.66
182      Toothpick                          4.03
183      Dragon's Greatsword                1.09
Name: Price, Length: 183, dtype: float64

In [48]:
most_profit_total = purchase_data.groupby(["Item ID", "Item Name"]).sum()["Price"]
most_profit_total

Item ID  Item Name
0        Splinter                            5.12
1        Crucifer                            9.78
2        Verdict                            14.88
3        Phantomlight                       14.94
4        Bloodlord's Fetish                  8.50
                                            ...
179      Wolf, Promise of the Moonwalker    26.88
180      Stormcaller                         3.36
181      Reaper's Toll                       8.30
182      Toothpick                          12.09
183      Dragon's Greatsword                 3.27
Name: Price, Length: 183, dtype: float64

In [49]:
df6 = pd.DataFrame({"Purchase Count": most_profitable_items, "Item Price": most_profit_price, "Total Purchase Value": most_profit_total})
df6.sort_values("Purchase Count", ascending=False).head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

In [50]:
df6.sort_values("Total Purchase Value", ascending=False).head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80